{
    "Title": "3.6 Customer Contract .1.6 Fidelity Fidelity-NFS-3.6.1.6.2.2 20030101 Fidelity WSOD Master Services Agreement (1)_raw_extract.txt",
    "Summary": "This Master Web Services Agreement outlines the terms of service between Fidelity Brokerage Services LLC and Wall Street On Demand, Inc. for the provision of online research aggregation services, reports, and applications. Fidelity will pay Wall Street On Demand a monthly licensing fee based on the services used. The agreement includes a Service Level Agreement (SLA) that defines the service levels required for the ongoing support of the services provided to Fidelity. The agreement also includes security requirements for the protection of Fidelity's customer data.",
    "Document Type": "Master Services Agreement With a Client",
    "Execution Date": "January 1, 2003",
    "Effective Date": "January 1, 2003",
    "End or Renewal Date": "None",
    "Automatic Renewal": true,
    "Duration": "Three (3) years initial term, automatically renewing for successive one (1) year periods",
    "Amendments": "Addendum A dated October 26, 2000, Addendum B dated November 29, 2000, Addendum D dated February 1, 2002, Addendum E dated August 12, 2002",
    "Committed Fees": "Monthly licensing fee based on services used, minimum of $35,000 per month. Aggregated Data Feed: $20,000 or $25,000. Hosted Web Services: $10,000 or $13,000 (Retail), $5,000 or $7,500 (IBG). Research Applications: $15,500 (Ford Stock Quant Tool), $5,000 (Stock Screener Tool).",
    "Parties Involved": "Fidelity Brokerage Services LLC and Wall Street On Demand, Inc.",
    "Key Terms": "Services, Aggregated Data Feed, Hosted Web Services, Research Applications, Service Level Agreement, Security Requirements, Confidential Information, Indemnification, Termination, Payment, Price Increases, Audit Rights",
    "Products or Services": "APIs, Guided Investing, Managed Services, Hypo Tool, Dynamic Video, Data, Conversational UI, ESG, Charting, SmartText, Calculators, Search, User Analytics, SmartShare, Personalization, Options Analysis, Screener, MIND",
    "Is Addendum": false,
    "References to Other Documents": "Exhibit A: Content List and Descriptions, Exhibit B: Rate Schedule, Exhibit C: Service Level Agreement, Exhibit D: Security Requirements, Exhibit E: WSOD Vendor Requirements",
    "Significant Legal Terms": {
        "16.1.  Unlimited Liability": "None",
        "16.2   Broad Indemnification": "Present",
        "16.3   Warranty of Performance": "Present",
        "16.4   Source Code Escrow": "None",
        "16.5   Unilateral Amendment Rights": "Present",
        "16.6   Mandatory Service Level Agreements (SLAs)": "Present",
        "16.7   Service Credits": "Present",
        "16.8   Most Favored Customer Clause (or Most Favored Nation)": "None",
        "16.9   Extensive Data Privacy Requirements": "Present",
        "16.10  Intellectual Property Assignment": "None",
        "16.11  Performance Bonds": "None",
        "16.11  Joint IP Ownership": "None",
        "16.12  Termination at Will or for Convenience": "Present",
        "16.13  Assignment Consent": "Present"
    },
    "Your Commentary": "As Fincentric, the terms of this contract are generally disadvantageous. The broad indemnification clause places a significant financial burden on Fincentric, as it is responsible for any claims related to the use of the hardware, software, or content. The warranty of performance clause also presents a risk, as Fincentric is obligated to ensure the performance, uptime, and functionality of the services. The unilateral amendment rights clause allows Fidelity to make changes to the agreement without Fincentric's consent, which could lead to unfavorable changes. The mandatory service level agreements (SLAs) with severe penalties for non-compliance could be financially burdensome. The service credits clause reduces Fincentric's revenue and profitability. The extensive data privacy requirements increase compliance costs and complexity. The termination at will clause leaves Fincentric vulnerable to sudden revenue loss. The assignment consent clause limits Fincentric's ability to transfer rights and obligations. Overall, the contract is heavily weighted in favor of Fidelity and places significant financial and legal risks on Fincentric."
}